import sys
string = sys.argv[1]

# цю змінну використаємо для підрахунку дужок
count = 0
# а цю для відповіді. На початку вважаємо, що послідовність правильна
flag = True

# перевіряємо всі символи рядка, рахуючи ВІЛЬНІ ВІДКРИТІ дужки
for char in string:
    # +1 коли знаходимо '('
    if char == '(':
        count = count + 1
    # -1 коли вона закривається
    elif char == ')':
        count = count - 1
    # якщо закриваючих дужок стає більше ніж відкриваючих - послідовність невірна
    if count < 0:
        flag = False

# після проходження послідовності не повинно залишитися невикористаних дужок
if flag and count == 0:
    print 'YES'
else:
    print 'NO'